###############################################################################
#                                                                             #
#                    Пример конфигурационного файла T-Hist                    #
#                                                                             #
###############################################################################
;
; Все параметры и их значения регистронезависимые за исключением имён файлов
; в Linux.
;
; Апострофы в описаниях параметров не являются элементами параметров или их
; значений, а используются только для улучшения читаемости текста.
;
; Комментарии могут начинаться с символов '#' и ';'.
;
; -----------------------------------------------------------------------------
;
; Конфигурационный файл T-Hist состоит из секций [COMMON] и [LINE].
; В секции [COMMON] задаются параметры, общие для всех обрабатываемых логов.
; В секции [LINE] задаётся конкретный бинарный лог и параметры, относящиеся
; только к этому логу.
;
; Директивы [LINE] и [COMMON] могут присутствовать в конфигурационном файле
; многократно. Каждая новая директива [LINE] начинает описание нового лога;
; каждая новая директива [COMMON] продолжает описание общих параметров.
;
; Параметры 'History' и 'Name' можно использовать только в секции [LINE].
; Параметры 'AdvancedCPS', 'BinkdAborted', 'BusyHist', 'CutHistory',
; 'SwapInOut' и 'TimeShift' можно использовать как в секции [LINE], так и
; в [COMMON].
; Все остальные параметры можно использовать только в секции [COMMON].
;
; Если параметр может использоваться и в секции [COMMON], и в секции [LINE],
; то значение этого параметра, заданное в секции [COMMON], применяется к тем
; бинарным логам, для которых этот параметр не был задан в секции [LINE].
;

###############################################################################

[COMMON]     ; Начало секции с общими для всех обрабатываемых логов параметрами

; -----------------------------------------------------------------------------

; Output t-hist.out
;
; Имя выходного файла с графиком и гистограммами загрузки FTN-системы.
; Параметру соответствует опция командной строки '-o'.
;
; Значение по умолчанию: 't-hist.out'.
;
; В имени файла можно использовать спецификаторы форматов, вместо которых при
; создании файла будут подставлены значения, получаемые из текущей даты и 
; текущего времени. Допустимые спецификаторы и их значения:
;
;   %Y - год в четырехзначном формате (например, 2026);
;   %y - год в двузначном формате без века (от 00 до 99);
;   %m - номер месяца в виде десятичного числа от 01 до 12;
;   %d - день месяца в виде десятичного числа от 01 до 31;
;   %j - день года в виде десятичного числа от 001 до 366;
;   %w - день недели в виде десятичного числа от 0 до 6,
;        где 0 - это воскресенье, 1 - понедельник, 6 - суббота;
;   %u - день недели в виде десятичного числа от 1 до 7,
;        где 1 - это понедельник, 7 - воскресенье;
;   %H - час в 24-часовом формате от 00 до 23;
;   %M - минуты в виде десятичного числа от 00 до 59;
;   %S - секунды в виде десятичного числа от 00 до 59;
;   %% - символ '%'.
;
; Например,
;
;   'Output /home/user/fido/t-hist-%Y-%m-%d.out'
;
; создаст 14 октября 2026 года файл /home/user/fido/t-hist-2026-10-14.out
;
; Если перед именем файла поставить символ '+', то создаваемая статистика
; будет добавляться в конец файла, если он уже существует.
;
; Например
;
;   'Output +/home/user/fido/t-hist.out'
;
; Если файл с графиком и гистограммами не нужен, то в качестве имени файла
; можно в Linux использовать '/dev/null', а в Windows - 'nul'.
;
; Параметр 'Output' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; LinkStat t-hist.lnk
;
; Имя выходного файла с таблицей статистики по линкам.
; Параметру соответствует опция командной строки '-l'.
;
; Значение по умолчанию: 't-hist.lnk'.
;
; Правила задания имени файла точно такие же, как у параметра 'Output'.
;
; Параметр 'LinkStat' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; SessionStat t-hist.ses
;
; Имя выходного файла с таблицей сессий.
; Параметру соответствует опция командной строки '-s'.
;
; Значение по умолчанию: 't-hist.ses'.
;
; Правила задания имени файла точно такие же, как у параметра 'Output'.
;
; Параметр 'SessionStat' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; Date 15.10.2026
;
; Дата, для которой будет создана статистика.
; Параметру соответствует опция командной строки '-d'.
;
; Значение по умолчанию: текущая дата
;
; Дата задается в формате 'DD.MM.YYYY', где DD - день, MM - месяц, YYYY - год.
; Каждый из элементов даты может быть задан как в абсолютном значении
; (положительные числа), так и в относительном (отрицательные числа).
;
; Положительные числа означают день, месяц или год календарной даты.
; Отрицательные числа означают смещение в прошлое относительно текущего дня,
; месяца или года соответственно.
;
; Если значение элемента даты пропущено или равно 0, то используется значение
; текущего дня, месяца или года.
;
; Если номер дня больше, чем количество дней в заданном месяце, то номер дня
; становится равным номеру последнего дня в этом месяца, и в stderr выводится
; предупреждающее сообщение.
;
; Примеры:
;
;   Date 15.10.2026     ; 15 октября 2026 года
;   Date 1.6            ; 1 июня текущего года
;   Date 7..2026        ; 7 число текущего месяца 2026 года
;   Date 25             ; 25 число текущего месяца и текущего года
;   Date 1.-1           ; первое число предыдущего месяца
;   Date 31.-1          ; последнее число предыдущего месяца
;   Date 40.-1          ; последнее число предыдущего месяца
;                       ; (автоматическая корректировка)
;   Date 20.-2          ; 20 число предпредыдущего месяца
;   Date 0.0.0          ; текущая дата
;   Date ..             ; текущая дата
;   Date 0              ; текущая дата
;   Date                ; текущая дата
;   Date -1             ; предыдущая дата ("вчера")
;   Date -2             ; предпредыщущая дата ("позавчера")
;   Date -100           ; за 100 дней до текущей даты
;
; Параметр 'Date' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; Time 0-8
;
; Интервал времени (не более 24 часов), для которого будет создаваться
; статистика. Параметру соответствует опция командной строки '-t'.
;
; Значение по умолчанию: '00:00:00-23:59:59'.
;
; Интервал времени указывается в виде 'hh:mm:ss-HH:MM:SS', где
; hh:mm:ss - время начала статистики, HH:MM:SS - время завершения статистики.
; Между ними ставится дефис '-' (можно с пробелами: ' - ').
;
; Если время начала больше либо равно времени завершения, то временной интервал
; будет начинаться со времени hh:mm:ss предшествующих суток и заканчиваться
; временем HH:MM:SS суток, для которых строится статистика.
;
; Значения часов, минут и секунд можно опускать. В это случае будет подставлено
; значение '0'. Например,
;
;   Time 0:30-7:30  ; 0:30:00 -  7:30:00
;   Time 0-8        ; 0:00:00 -  8:00:00
;   Time :30-7::59  ; 0:30:00 -  7:00:59
;   Time -8         ; 0:00:00 -  8:00:00
;   Time 1-         ; 1:00:00 - 23:59:59
;   Time -          ; 0:00:00 - 23:59:59
;   Time            ; 0:00:00 - 23:59:59
;   Time 23:30-7:30 ; с 23:30:00 даты, предшествующей дате статистики,
;                   ; до 7:30:00 даты статистики
;   Time 22-22      ; с  22:00:00 даты, предшествующей дате статистики,
;                   ; до 22:00:00 даты статистики
;   Time 0-0        ; 0:00:00 - 23:59:59
;   Time 0-24       ; 0:00:00 - 23:59:59
;
; Замечание 1. Длина графика загрузки и диапазон отрезка времени для гистограмм
; определяется с точностью до целого часа: время начала округляется вниз до
; начала часа, времени окончания - вверх до начала следующего часа.
; Например, для интервала 'Time 0:30-7:30' ось времени графика и гистограмм
; будет иметь интервал от 0 до 8 часов.
;
; Замечание 2. Интервал на оси времени графика и гистограмм может превышать
; длину временного интервала, заданного параметром Time. Длина графика в часах
; может быть только: 1, 2, 3, 4, 6, 8, 12, 16 или 24 часа (делители числа 48).
; Если длина интервала, заданного параметром Time, не совпадает ни с одним из
; эти чисел, то длина интервал оси времени графика и гистограмм будет ближайшим
; допустимым числом, не меньшим, чем заданный интервал.
;
; Параметр 'Time' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; TimeShift 0
;
; Сдвиг времени начала сессий, прочитанных из бинарного лога, на заданное число
; часов вперёд или назад. Параметру соответствует опция командной строки '-z'.
;
; Значение по умолчанию: 0
;
; Параметр позволяет скорректировать время начала сессий, если статистика
; оказывается смещена относительно реальных временных интервалов.
;
; Допустимые значения параметра:
;
;   TimeShift <N>   ; сдвинуть время начала каждой сессии на N часов
;                   ; (N - целое число, которое может быть отрицательным)
;   TimeShift Auto  ; сдвинуть время начала каждой сессии на величину смещения
;                   ; локального времени от UTC в момент данной сессии
;   TimeShift       ; то же, что 'TimeShift Auto'
;
; Используйте 'TimeShift Auto' или просто 'TimeShift', если мейлер записывает
; в бинарный лог отметки времени по UTC. (Таким мейлером, например, является
; qico 0.60.2+.)
;
; Замечание. Утилита DmpHist не принимает во внимание параметр 'TimeShift',
; если он присутствует в конфигурационном файле, и выводит время начала сессий
; в точности так, как оно записано в бинарном логе, без каких-либо
; корректировок.
;
; Параметр 'TimeShift' можно использовать как в секции [COMMON], так и
; в секциях [LINE].
; -----------------------------------------------------------------------------

; WideScreen Yes
;
; Параметр определяет, использовать ли режим широкого экрана, при котором
; в статистике могут выводиться строки длинее 80 символов. Параметру
; соответствует опция командной строки '-w'.
;
; Значение по умолчанию: 'Yes'.
;
; Если обрабатываемый бинарный лог содержит текстовую информацию о FTN-системах
; или информацию о протоколах соединения (это бинарные логи мейлеров:
; qico 0.60.2+, Internet Rex, FrontDoor, Bink/+, FhMail, BinkleyTerm-XE,
; KittenMail, The Brake!, некоторых мейлеров с логами в новом формате T-Mail,
; а также бинарные логи собственного формата T-Hist), или если при задании
; адресов в параметрах 'Addr' были указаны описания (параметр 'Addr' см. ниже),
; то в режиме широкого экрана справа от графика загрузки и справа от таблиц со
; статистикой будет выводиться прочитанная из бинарного лога текстовая
; информация или указанные в параметрах 'Addr' описания адресов.
; Если для адреса существует одновременно и текстовая информация из бинарного
; лога и описание в параметре 'Addr', то приоритет имеет информация из лога.
;
; Допустимые значения параметра: 
;
;   WideScreen Yes      ; включить режим широкого экрана без ограничения длины
;                       ; выводимых строк
;   WideScreen No       ; выключить режим широкого экрана, длина выводимых
;                       ; строк будет не более 80 символов
;   WideScreen <N>      ; (N - целое число) включить режим широкого экрана и
;                       ; установить длину выводимых строк не более N символов
;                       ; (если задать N < 80, то режим широкого экрана будет
;                       ; выключен
;   WideScreen          ; то же, что 'WideScreen Yes'
;
; Замечание. Бинарные логи Binkd не содержат текстовую информацию. Поэтому
; если в парамерах 'Addr' не заданы описания адресов, то для логов Binkd
; не будет разницы между включенным и выключенным режимом широкого экрана -
; все выводимые строки в обоих случая будут иметь длину не более 80 символов.
;
; Параметр 'WideScreen' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; Group Yes
;
; Параметр определяет, выводить ли статистику для групп адресов и отображать
; ли группы адресов на графике загрузки (о группах адресов читайте ниже в
; описании параметра 'Addr'). Параметру соответствует опция командной
; строки '-g'.
;
; Значение по умолчанию: 'Yes'.
;
; Допустимые значения:
; 
;   Group Yes           ; отображать группы на графике и в статистике линков
;                       ;
;   Group No            ; не отображать группы на графике и в статистике линков
;                       ;
;   Group               ; то же, что 'Group Yes'
;
; Параметр 'Group' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; MiddLine Group
;
; Параметр определяет, разделять ли строки на графике загрузки горизонтальной
; линией. Параметру соответствует опция командной строки '-m'.
;
; Значение по умолчанию: 'No'.
;
; Допустимые значения: 
;
;   MiddLine Yes        ; разделять все строки графика
;                       ;
;   MiddLine No         ; не разделять строки графика
;                       ;
;   MiddLine Group      ; разделять только те строки, которые принадлежат
;                       ; разным группам адресов
;                       
; Параметр 'MiddLine' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; KeepAll Yes
;
; Параметр определяет, отображать ли на графике и в статистике линков все
; адреса и группы адресов, заданные параметрами 'Addr', или только те,
; с которыми были сессии. Параметру соответствует опция командной строки '-k'.
;
; Значение по умолчанию: 'No'.
;
; Допустимые значения: 
;
;   KeepAll Yes         ; выводить на графике и в статистике линков все адреса
;                       ; и группы адресов, даже если с ними не было ни одной
;                       ; сессии
;   KeepAll No          ; выводить на графике и в статистике линков только те
;                       ; адреса и группы адесов, с которыми были сессии
;                       ;
;   KeepAll             ; то же, что 'KeepAll Yes'
;
; Параметр 'KeepAll' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; ShowValue Ses
;
; По умолчанию после каждой строки графика выводится число сессий и значения
; полученного и переданного трафика. Параметр 'ShowValue' позволяет вместо
; числа сессий выводить суммарное время сессий в минутах или средний CPS.
; Параметру соответствует опция командной строки '-s'.
;
; Допустимые значения: 
;
;   ShowValue Ses       ; выводить число сессий
;                       ;
;   ShowValue CPS       ; выводить средний CPS
;                       ;
;   ShowValue Time      ; выводить суммарное время сессий в минутах
;
; Параметр 'ShowValue' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; BusyHist TIOPU$
;
; Параметр определяет, какие гистограммы будут выведены после графика загрузки.
; Параметру соответствует опция командной строки '-b'.
;
; Значение по умолчанию: 'Yes' (выводить все гистограммы).
;
; Допустимые значения: 
;
;   BusyHist Yes        ; выводить все гистограммы
;                       ;
;   BusyHist No         ; не выводить ни одной гистограммы
;                       ;
;   BusyHist            ; то же, что 'BusyHist Yes'
;                       ;
;   BusyHist <mask>     ; выводить гистограммы, заданные маской <mask>
;                       ; маска - строка из следующих символов в любом порядке:
;                       ;   T - гистограмма всех сессий (общая загрузка)
;                       ;   I - гистограмма входящих сессий
;                       ;   O - гистограмма исходящих сессий
;                       ;   P - гистограмма сессий с паролем
;                       ;   U - гистограмма сессий без пароля
;                       ;   $ - не выводить пустые гистограммы
;                       ; символы 'P' и 'U' учитываются только для мейлеров, 
;                       ; отмечающих парольные сессии в бинарном логе
;
; Замечание. Не все мейлеры сохраняют в бинарных логах отметки парольных
; сессий. Для таких мейлеров гистограммы парольных и непарольных сессий
; строиться не будут независимо от значения парамера 'BusyHist'.
;
; Параметр 'BusyHist' можно использовать как в секции [COMMON], так и
; в секциях [LINE].
; -----------------------------------------------------------------------------

; NoDrawEmpty Yes
;
; Параметр определяет, отмечать ли на графике и учитывать ли при построении
; гистограмм "пустые" сессии, то есть сессии с нулевым трафиком.
; Старое название параметра: 'NoDrawZero'.
; Параметру соответствует опция командной строки '-n'.
;
; Значение по умолчанию: 'No'.
;
; Допустимые значения: 
;
;   NoDrawEmpty Yes     ; отмечать пустые сессии на графике
;                       ; и учитывать при построении гистограмм
;   NoDrawEmpty No      ; не отмечать пустые сессии на графике
;                       ; и не учитывать при построении гистограмм
;   NoDrawEmpty         ; то же, что 'NoDrawEmpty Yes'
;
; Параметр 'NoDrawEmpty' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; ProtectSummary Yes
;
; Параметр определяет, выводить ли в сумарной информации в конце статистики
; информацию по парольным и непарольным сессиям.
;
; Значение по умолчанию: 'No'.
;
; Допустимые значения: 
;
;   ProtectSummary Yes  ; выводить суммарную информацию по парольным
;                       ; и непарольным сессиям
;   ProtectSummary No   ; не выводить суммарную информацию по парольным
;                       ; и непарольным сессиям
;   ProtectSummary      ; то же, что 'ProtectSummary Yes'
;
; Значение параметра учитывается только если форматы всех обрабатываемых
; бинарных логов позволяют отмечать защищённые паролем сессии. Если хотя бы
; один из обрабатываемых бинарных логов такой возможности не имеет, то
; суммарная информация по парольным и непарольным сессиям выводиться не будет
; независимо от значения параметра 'ProtectSummary'. В частности, это
; относится к бинарным логам мейлера Binkd (старый формат T-Mail).
;
; Параметр 'ProtectSummary' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; DecimalUnits No
;
; Параметр определяет, использовать ли при выводе значений трафика единицы
; измерения, основанные на десятичных степенях (kB, MB, GB), или основанные
; на двоичных степенях (KiB, MiB, GiB). Параметру соответствует опция командной
; строки '-r'.
;
; Значение по умолчанию: 'No'.
;
; Допустимые значения: 
;
;   DecimalUnits Yes    ; использовать десятичные единицы измерения:
;                       ;   kB  - 1,000 байт
;                       ;   MB  - 1,000,000 байт
;                       ;   GB  - 1,000,000,000 байт
;   DecimalUnits No     ; использовать двоичные единицы измерения:
;                       ;   KiB - 1,024 байт
;                       ;   MiB - 1,048,576 байт
;                       ;   GiB - 1,073,741,824 байт
;   DecimalUnits        ; то же, что 'DecimalUnits Yes'
;
; Чтобы сэкономить место в таблицах, обозначения величин в статистике выводятся
; однобуквенными (K, M, G), а после суммарной информации выводится расшифровка,
; означают ли эти буквы двоичные единицы измерения (KiB, MiB, GiB) или десятичные
; (kB, MB, GB).
;
; Параметр 'DecimalUnits' можно использовать только в секции [COMMON].
; -----------------------------------------------------------------------------

; AdvancedCPS Yes
;
; Параметр определяет способ расчёта среднего CPS (Chars Per Second, что
; эквивалентно bytes/s).
;
; Значение по умолчанию: 'Yes'.
;
; Допустимые значения: 
;
;   AdvancedCPS Yes     ; из длительности каждой непустой сессии (сессии с
;                       ; ненулевым траффиком) вычитается средняя длительность
;                       ; пустых сессий (с нулевым траффиком) для данного
;                       ; адреса или группы адресов, а затем величина трафика
;                       ; делится на сумму скорректированных длительностей
;                       ; непустых сессий
;                       ;
;   AdvancedCPS No      ; длительность сессий не корректируется перед
;                       ; расчётом CPS
;                       ;
;   AdvancedCPS         ; то же, что 'AdvancedCPS Yes'
;
; Параметр 'AdvancedCPS' можно использовать как в секции [COMMON], так и
; в секциях [LINE].
; -----------------------------------------------------------------------------

; SwapInOut No
;
; Параметр позволяет скорректировать ситуацию когда в бинарном логе
; инвертирована отметка входящих и исходящих сессий (входящие отмечены как
; исходящие, а исходящие как входящие). В частности, это относится к бинарным
; логам мейлера Binkd.
;
; Значение по умолчанию: 'No'.
;
; Допустимые значения: 
;
;   SwapInOut Yes       ; входящие сессии считать исходящими, а исходящие -
;                       ; входящими
;   SwapInOut No        ; не инвертировать направление сессий
;                       ;
;   SwapInOut           ; то же, что 'SwapInOut Yes'
;
; Параметр 'SwapInOut' можно использовать как в секции [COMMON], так и
; в секциях [LINE].
; -----------------------------------------------------------------------------

; BinkdAborted In
;
; В бинарном логе Binkd для оборванных сессий не содержится информации об их
; направлении. Данный параметр определяет, считать ли оборванные сессии
; входящими или исходящими.
;
; Значение по умолчанию: 'In'.
;
; Допустимые значения: 
;
;   BinkdAborted In     ; все оборванные сессии считать входящими
;                       ;
;   BinkdAborted Out    ; все оборванные сессии считать исходящими
;
; Значение параметра учитывается только при обработки бинарных логов Binkd.
; Для всех остальных поддерживаемых форматов этот параметр игнорируется.
;
; Параметр 'BinkdAborted' можно использовать как в секции [COMMON], так и
; в секциях [LINE].
; -----------------------------------------------------------------------------

; CutHistory 7
;
; Параметр определяет, выполнять ли обрезание бинарного лога после построения
; статистики. 
;
; Значение по умолчанию: 0 (обрезание лога не выполнять).
;
; Значением параметра является целое неотрицательное число, задающее количество
; суток (включая текущие сутки), данные за которые будут сохранены в бинарном
; логе после обрезания. Например,
;
;   CutHistory 0  ; лог не обрезать
;                 ;
;   CutHistory 1  ; обрезать лог, сохранив записи за текущие сутки ("сегодня")
;                 ;
;   CutHistory 2  ; обрезать лог, сохранив записи за текущие и предыщущие сутки
;                 ; ("вчера" и "сегодня")
;   CutHistory 3  ; обрезать лог, сохранив записи за последние трое суток
;                 ; ("позавчера", "вчера" и "сегодня")
;   CutHistory 30 ; обрезать лог, сохранив записи за последние 30 суток,
;                 ; включая текущие сутки
;
; Возможность обрезания бинарного лога реализована для логов следующих
; форматов/мейлеров: логи Binkd, логи T-Mail старого и нового форматов,
; логи KittenMail и логи всех версий собственного формата T-Hist.
; Для остальных поддерживаемый форматов обрезание не выполняется, а параметр
; 'CutHistory' игнорируется.
;
; Параметр 'CutHistory' можно использовать как в секции [COMMON], так и
; в секциях [LINE].

###############################################################################

[LINE]           ; Начало секции с параметрами обработки первого бинарного лога

; -----------------------------------------------------------------------------

History /var/log/fido/binlog.dat,2,2

; Параметр 'History' задаёт бинарный лог для обработки.
; Этот параметр обязательно должен присутствовать в каждой секции [LINE],
; и только по одному разу.
;
; Формат параметра:
;
;   History <binary_log>[,<N>[,<M>]]
;
; Здесь <binary_log> - имя файла бинарного лога для обработки,
;       <N> и <M>    - неотрицательные целые числа или пусто.
;
; Запятые и числа должны идти сразу после имени файла без пробелов. Пробел,
; символ табуляции или знак комментария завершают обработку параметра.
;
; Необязательные числа N и M задают максимальное число одновременно
; проводящихся входящих (N) и исходящих (M) сессий. Эти значения нужны для
; расчёта процента загрузки FTN-системы и для масштабирования гистограмм.
; Возможность проводить одновременно несколько сессий типично для IP-мейлеров.
;
; Если после имени бинарного лога нет запятой (а значит и нет чисел N и M),
; то считается, что одновременно проводящиеся сессии отсутствуют, процент 
; загрузки не корректируется, масштабирование гистограмм не производится.
; Отсутствие одновременно проводящихся сессий типично для модемных линий.
;
; Если запятая после имени бинарного лога есть, то считается, что возможны
; одновременно проводящиеся сессии. При этом если какое-либо из чисел
; (или оба) отсутствует, то вместо отсутствующего числа по умолчанию
; используется единица (не ноль!).
;
; Примеры:
;
;   History binlog.dat     ; одновременно проводящиеся сессии отсутствуют
;                          ; (типично для модемных линий)
;   History binlog.dat,1,1 ; одновременно может проводиться не более 1 входящей
;                          ; и не более 1 исходящей сессий
;   History binlog.dat,2,4 ; одновременно может проводиться не более 2 входящих
;                          ; и не более 4 исходящих сессий
;   History binlog.dat,2   ; одновременно может проводиться не более 2 входящих
;                          ; и не более 1 исходящей сессий
;   History binlog.dat,,4  ; одновременно может проводиться не более 1 входящей
;                          ; и не более 4 исходящих сессий
;   History binlog.dat,    ; то же, что 'History binlog.dat,1,1'
;                          ;
;   History binlog.dat,,   ; то же, что 'History binlog.dat,1,1'
;                          
; Одно из двух чисел можно явно задать равным нулю. В этом случае считается,
; что соответствующих сессий не бывает вообще. Если нулевым задано число
; входящий сессий, то все сессии в бинарном логе будет считаться исходящими
; независимо от их действительного направления. Аналогично, если нулевым
; задано число исходящих сессий, то все сессии в бинарном логе будет считаться
; входящими. В случае задания нулевых значений для обоих чисел программа
; сообщит об ошибке и завершит работу.
;
; Примеры:
;
;   History binlog.dat,0,4 ; входящих сессий не бывает, возможно не более
;                          ; 4 исходящих сессий одновременное
;   History binlog.dat,2,0 ; исходящих сессий не бывает, возможно не более
;                          ; 2 входящих сессий одновременное
;   History binlog.dat,0   ; то же, что 'History binlog.dat,0,1'
;                          ; 
;   History binlog.dat,,0  ; то же, что 'History binlog.dat,1,0'
;                          ; 
;   History binlog.dat,0,0 ; ошибка
;
; Замечание 1. Из-за особенностей формата бинарных логов Binkd, при их задании
; обязательно требуется указать хотя бы одну запятую после имени файла. Только
; так T-Hist может отличить бинарный лог Binkd от бинарных логов других
; мейлеров, использующих формат лога старых версий T-Mail.
;
; Замечение 2. Для бинарных логов мейлеров FrontDoor, Bink/+, BinkleyTerm-XE,
; FhMail, Internet Rex, KittenMail и The Brake! значения N и M игнорируются,
; процент загрузки не корректируется, гистограммы не масштабируются.
;
; Параметр 'History' можно использовать только в секции [LINE].
; -----------------------------------------------------------------------------

; Name "Первая линия"
; 
; Параметр задаёт текстовую строку, которая будет выведена перед таблицей
; сессий и перед гистограммами для данного бинарного лога.
;
; Значение по умолчанию:
;
;   Если обрабатывается только один бинарный лог - пустая строка.
;
;   Если обрабатывается несколько бинарных логов - строка "Line N",
;   где N - порядковый номер секции [LINE] в конфигурационном файле.
;
; Параметр 'Name' можно использовать только в секции [LINE].

###############################################################################

;[LINE]         ; Начало секции с параметрами обработки второго бинарного лога

; -----------------------------------------------------------------------------

; History /var/log/fido/binkd.sts,2,2
;		; бинарный лог мейлера Binkd, способного одновременно проводить
;               ; не более 2 входящих и не более 2 исходящих сессий
;
; Name "Binkd line"
;
; SwapInOut Yes ; для данного бинарного лога менять местами отметки входящих
;               ; и исходящих сессий
;
; BinkdAborted Out
;               ; считать все оборванные сессии исходящими
;
; BusyHist TIO$ ; для данного бинарного лога строить только непустые
;               ; гистограммы: общей загрузки, для входящих сессий,
;               ; для исходящих сессий
;
; CutHistory 30 ; обрезать бинарный лог после обработки, оставляя только записи
;               ; за последние 30 суток, включая текущие сутки

###############################################################################

;[LINE]         ; Начало секции с параметрами обработки третьего бинарного лога

; -----------------------------------------------------------------------------

; History /var/log/fido/qico-binlog
;
; Name "qico line"
;
; TimeShift Auto
;               ; для данного бинарного лога  прибавлять ко времени начала
;               ; каждой сессии смещение локального времени относительно UTC
;
; BusyHist TIOPU$
;               ; для данного бинарного лога строить все непустые гистограммы
;
; CutHistory 7  ; обрезать бинарный лог после обработки, оставляя только записи
;               ; за последние 7 суток, включая текущие сутки

###############################################################################

[COMMON]        ; Продолжение секции с общими для всех логов параметрами

; -----------------------------------------------------------------------------

; FTN-адреса, для которых создаётся статистика, задаются с помощью параметров
; 'Addr' и опций командной строки '-a'. Формат параметра:
;
; Addr <address> ["<description>"]
;
; где  <address>     - FTN-адрес вида '<Zone>:<Net>/<Node>.<Point>'
;
;      <description> - необязательная текстовая строка с описанием адреса,
;                      которая может выводиться справа от строки таблицы
;                      и строки графика в режиме широкого экрана
; Например,
;
; Addr 2:5020/378.0 "Мой адрес"
;
; Каждое из полей адреса <Zone>, <Net>, <Node>, <Point> - либо целое число
; от 0 до 32767 включительно, либо символ подстановки '*', либо пусто.
;
; Параметры 'Addr' можно использовать многократно, но только в секции [COMMON]
;
; -----------------------------------------------------------------------------
;
; Использование хотя бы одного символа подстановки '*' при задании адреса
; делает этот адрес группой. Для каждого адреса из бинарного лога, который
; соответствует хотя бы одной заданной группе, будет создана строка таблицы
; линков и строка графика. Также сессии с этим адресом будут учтены в групповой
; статистике для этой группы в таблице групп и на графике для групп.
;
; Любое из полей <Zone>, <Net>, <Node>, <Point> может быть пропущено.
; Отсутствующие поля автоматически заменяются на символы подстановки '*'.
; Примеры:
;
; ### что задано ### ; ### что будет использовано ###
;
; Addr 2:5020/378    ; Addr 2:5020/378.*
; Addr 2:5020        ; Addr 2:5020/*.*
; Addr 2:            ; Addr 2:*/*.*
; Addr 2:5020.378    ; Addr 2:5020/*.378
; Addr 2:/378        ; Addr 2:*/378.*
; Addr 2:/.378       ; Addr 2:*/*.378
; Addr 2:.378        ; Addr 2:*/*.378
; Addr :5020/378     ; Addr *:5020/378.*
; Addr :5020.378     ; Addr *:5020/*.378
; Addr :5020         ; Addr *:5020/*.*
; Addr 5020/         ; Addr *:5020/*.*
; Addr 5020/378      ; Addr *:5020/378.*
; Addr 5020.378      ; Addr *:*/5020.378
; Addr /378.0        ; Addr *:*/378.0
; Addr 378.0         ; Addr *:*/378.0
; Addr 378           ; Addr *:*/378.*
; Addr :/.           ; Addr *:*/*.*
; Addr :/            ; Addr *:*/*.*
; Addr :.            ; Addr *:*/*.*
; Addr /.            ; Addr *:*/*.*
; Addr :             ; Addr *:*/*.*
; Addr /             ; Addr *:*/*.*
; Addr .             ; Addr *:*/*.*
; Addr               ; Addr *:*/*.*
;
; -----------------------------------------------------------------------------
;
; Существуют предопределённые имена адресов и групп адресов, которые можно
; использовать в параметрах 'Addr' и опциях командной строки '-a':
;
; Addr All           ; то же, что 'Addr *:*/*.*', то есть группа, охватывающая
;                    ; все сессии (как удачные, так и неудачные) со всеми
;                    ; адресами, встретившимися при обработке бинарных логов
;                    
; Addr Failed        ; подобно 'Addr All', но только для неудачных сессий
;                    ; (оборванных; с неудачным хэндшейком; завершившихся
;                    ; из-за какой-либо ошибки) с любыми адресами
;                    
; Addr Unresolved    ; то же, что 'Addr 0:0/0.0', то есть любая сессия, \
; Addr Undefined     ; завершившаяся неудачно на этапе хэндшейка        \
; Addr Unknown       ; до того, как был определён FTN-адрес             \
; Addr None          ; 
;
; Группа 'Failed' включает в себя 'Unresolved'/'Undefined'/'Unknown'/'None'.
;
; -----------------------------------------------------------------------------
;
; Можно исключать определенные адреса и группы адресов из статистики.
; Для этого перед адресом нужно поставить символ '!'. Например:
;
; Addr !2:5020/378.1 ; исключить из статистики адрес 2:5020/378.1
;                    ;
; Addr !2:5020/378   ; исключить из статистики группу адресов 2:5020/378.*
;                    ;
; Addr !2:*/9999.*   ; исключить из статистики группу адресов 2:*/9999.*
;                    ;
; Addr !Unresolved   ; исключить из статистики адрес 0:0/0.0, который
;                    ; соответствует сессиям, завершившимся неудачно на этапе
;                    ; хэндшейка до того, как был определён FTN-адрес
;                    ;
; Addr !Failed       ; исключить из статистики все неудачные сессии, как с
;                    ; конкретными адресами, так и с неопределёнными адресами
;
; -----------------------------------------------------------------------------
;
; Порядок задания адресов с помощью параметров 'Addr' неважен. Независимо от
; того, в каком порядке заданы адреса и группы адресов, при генерации
; статистики они будут отсортированы от менее общих к более общим. При этом
; исключаемые адреса и группы адресов будут размещены в начале списка. Повторы
; одних и тех же адресов будут игнорироваться. Подробнее о сортировке адресов
; читайте в файле документации T-HIST-ru.md
;
; В процессе генерации статистики для каждой прочитанной из бинарного лога
; сессии производится просмотр отсортированного списка адресов от начала к
; концу. Если адрес совпадёт с исключаемым из статистики, просмотр прекратится,
; и сессия будет проигнорирована. Иначе для каждого заданного параметрами
; 'Addr' или опциями '-a' адреса, с которым совпадёт прочитанный из бинарного
; лога адрес, будет добавлена информация об обрабатываемой сессии. После
; совпадения с неисключаемым адресом процесс не прерывается, и список адресов
; продолжает просматриваться до конца. Это позволяет учесть обрабатываемую
; сессию сразу в нескольких групповых статистиках.
;
; -----------------------------------------------------------------------------
;
; Если в конфигурационном файле не задано ни одного параметра 'Addr', то при
; генерации статистики будет использована группа по умолчанию 'Addr All',
; (синоним группы 'Addr *:*/*.*'), охватывающая все сессии со всеми адресами. 
;
; -----------------------------------------------------------------------------

Addr All
Addr Failed

###############################################################################
#                                                                             #
#                      Завершение конфигурационного файла                     #
#                                                                             #
###############################################################################
